{
  "zh": {
    "meta": {
      "title": "日期計算器",
      "description": "計算日期之間的差距，或從指定日期加減天數"
    },
    "calculator": {
      "tabs": {
        "addDays": "日期加天數",
        "subtractDates": "日期相減"
      },
      "startDate": "起始日期：",
      "days": "天數：",
      "endDate": "結束日期：",
      "result": "計算結果：",
      "weekdays": ["日", "一", "二", "三", "四", "五", "六"]
    },
    "about": {
      "title": "關於日期計算器",
      "description": "本工具提供兩種常用日期計算功能：",
      "features": [
        "計算兩個日期之間的天數差距",
        "從指定日期加上或減去天數"
      ],
      "usage": "無論是計劃行程、追蹤專案時間，或是計算合約期限、截止日期，都能使用此工具快速獲取準確結果。"
    },
    "calendarDays": {
      "definition": {
        "title": "日曆天的定義與計算方式",
        "p1": "日曆天是指專案開始到結束的實際天數，包含了工作日、週末以及法定假日。它反映了專案所占用的時間。",
        "p2": "日曆天的計算方式相對簡單，只需將專案開始日期與結束日期之間的差異天數相加即可。",
        "p3": "例如，若專案於3月1日開始，並於3月2日結束，則日曆天數為1天。",
        "p4": "例如，若專案於3月1日開始，並於3月31日結束，則日曆天數為30天。"
      },
      "difference": {
        "title": "日曆天與工作天(工期)的差異",
        "p1": "工作是指完成專案所需的工作日數，不包含週末及法定假日。它反映了團隊實際投入專案的時間。",
        "p2": "由於日曆天包含了非工作日，因此工作天通常會小於日曆天數。假設專案日曆天數為31天，其中22天為需要工作日，則工作日為22天。"
      },
      "application": {
        "title": "日曆天數與工期管理的應用",
        "items": [
          {
            "title": "專案進度追蹤：",
            "content": "通過日曆天數與工期的對比，項目經理可以掌握專案的實際進度。若日曆天數大幅超過預期工期，則表明專案可能存在延遲風險，需要採取措施加以應對。"
          },
          {
            "title": "資源分配與優化：",
            "content": "根據日曆天數與工期，項目經理可以合理分配團隊資源，並優化工作安排。例如，在節假日前夕，可以適當增加人力，以確保關鍵任務的按時完成。"
          },
          {
            "title": "風險管理：",
            "content": "日曆天計算有助於識別並管理專案風險。例如，若關鍵材料的交付日期恰好遇到長假，則可能導致專案延遲。項目經理需要提前識別此類風險，並制定應對措施。"
          }
        ]
      },
      "considerations": {
        "title": "日曆天計算的注意事項",
        "items": [
          {
            "title": "考慮時差因素：",
            "content": "若專案涉及跨時區合作，則需要在日曆天計算中考慮時差因素。不同時區的假日安排可能有所不同，需要進行協調以確保順暢的溝通與協作。"
          },
          {
            "title": "彈性調整：",
            "content": "雖然日曆天計算提供了一個時間管理的框架，但在實踐中仍需保持一定的彈性。針對突發事件或變更請求，項目經理需要及時調整日曆天安排，以確保專案的順利進行。"
          }
        ],
        "conclusion": "日曆天計算是專案時程管理的基礎，它為工期估算、進度追蹤以及資源優化提供了依據。通過理解日曆天與工期的關係，並恰當處理假日等特殊情況，項目經理可以更好地掌控專案時程，提高交付的準確性和效率。在日益複雜的專案環境中，精準的日曆天計算與靈活的工期管理將成為項目成功的關鍵因素。"
      }
    }
  },
  "en": {
    "meta": {
      "title": "Date Calculator",
      "description": "Calculate the difference between dates, or add/subtract days from a specific date"
    },
    "calculator": {
      "tabs": {
        "addDays": "Add Days to Date",
        "subtractDates": "Calculate Date Difference"
      },
      "startDate": "Start Date:",
      "days": "Days:",
      "endDate": "End Date:",
      "result": "Result:",
      "weekdays": ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"]
    },
    "about": {
      "title": "About the Date Calculator",
      "description": "This tool provides two common date calculation functions:",
      "features": [
        "Calculate the number of days between two dates",
        "Add or subtract days from a specified date"
      ],
      "usage": "Whether you're planning a trip, tracking project time, or calculating contract periods and deadlines, you can use this tool to quickly get accurate results."
    },
    "calendarDays": {
      "definition": {
        "title": "Definition and Calculation of Calendar Days",
        "p1": "Calendar days refer to the actual number of days from the start to the end of a project, including workdays, weekends, and holidays. It reflects the time occupied by the project.",
        "p2": "The calculation of calendar days is relatively simple, just add the difference in days between the project start date and end date.",
        "p3": "For example, if a project starts on March 1 and ends on March 2, the number of calendar days is 1 day.",
        "p4": "For example, if a project starts on March 1 and ends on March 31, the number of calendar days is 30 days."
      },
      "difference": {
        "title": "Difference Between Calendar Days and Work Days (Duration)",
        "p1": "Work days refer to the number of working days required to complete a project, excluding weekends and holidays. It reflects the actual time the team invests in the project.",
        "p2": "Since calendar days include non-working days, the number of work days is usually less than the number of calendar days. Assuming a project has 31 calendar days, of which 22 days are work days, then the work days are 22 days."
      },
      "application": {
        "title": "Applications of Calendar Days in Project Management",
        "items": [
          {
            "title": "Project Progress Tracking:",
            "content": "By comparing calendar days with work duration, project managers can grasp the actual progress of the project. If the number of calendar days significantly exceeds the expected duration, it indicates that the project may be at risk of delay and measures need to be taken to address it."
          },
          {
            "title": "Resource Allocation and Optimization:",
            "content": "Based on calendar days and work duration, project managers can reasonably allocate team resources and optimize work arrangements. For example, before holidays, manpower can be appropriately increased to ensure the timely completion of key tasks."
          },
          {
            "title": "Risk Management:",
            "content": "Calendar day calculation helps identify and manage project risks. For example, if the delivery date of key materials happens to coincide with a long holiday, it may cause project delays. Project managers need to identify such risks in advance and develop countermeasures."
          }
        ]
      },
      "considerations": {
        "title": "Considerations for Calendar Day Calculation",
        "items": [
          {
            "title": "Consider Time Difference Factors:",
            "content": "If the project involves cross-time zone collaboration, time difference factors need to be considered in the calendar day calculation. Holiday arrangements in different time zones may vary, and coordination is required to ensure smooth communication and collaboration."
          },
          {
            "title": "Flexible Adjustment:",
            "content": "Although calendar day calculation provides a framework for time management, some flexibility is still needed in practice. For unexpected events or change requests, project managers need to adjust calendar day arrangements in a timely manner to ensure the smooth progress of the project."
          }
        ],
        "conclusion": "Calendar day calculation is the foundation of project schedule management, providing a basis for duration estimation, progress tracking, and resource optimization. By understanding the relationship between calendar days and work duration, and properly handling special situations such as holidays, project managers can better control project schedules and improve the accuracy and efficiency of delivery. In increasingly complex project environments, precise calendar day calculation and flexible duration management will become key factors for project success."
      }
    }
  },
  "jp": {
    "meta": {
      "title": "日付計算機",
      "description": "日付間の差を計算したり、特定の日付から日数を追加・減算する"
    },
    "calculator": {
      "tabs": {
        "addDays": "日付に日数を追加",
        "subtractDates": "日付の差を計算"
      },
      "startDate": "開始日：",
      "days": "日数：",
      "endDate": "終了日：",
      "result": "計算結果：",
      "weekdays": ["日", "月", "火", "水", "木", "金", "土"]
    },
    "about": {
      "title": "日付計算機について",
      "description": "このツールでは、次の2つの一般的な日付計算機能を提供しています：",
      "features": [
        "2つの日付間の日数差を計算する",
        "指定された日付から日数を追加または減算する"
      ],
      "usage": "旅行の計画、プロジェクト時間の追跡、契約期間や期限の計算など、このツールを使用して迅速に正確な結果を得ることができます。"
    },
    "calendarDays": {
      "definition": {
        "title": "暦日の定義と計算方法",
        "p1": "暦日とは、プロジェクトの開始から終了までの実際の日数を指し、平日、週末、祝日を含みます。これはプロジェクトが占める時間を反映しています。",
        "p2": "暦日の計算は比較的簡単で、プロジェクトの開始日と終了日の間の日数差を足すだけです。",
        "p3": "たとえば、プロジェクトが3月1日に開始し、3月2日に終了する場合、暦日数は1日です。",
        "p4": "たとえば、プロジェクトが3月1日に開始し、3月31日に終了する場合、暦日数は30日です。"
      },
      "difference": {
        "title": "暦日と稼働日（工期）の違い",
        "p1": "稼働日とは、プロジェクトを完了するために必要な実際の作業日数を指し、週末や祝日は含まれません。これはチームがプロジェクトに実際に投資した時間を反映しています。",
        "p2": "暦日には非稼働日が含まれるため、稼働日数は通常、暦日数よりも少なくなります。プロジェクトの暦日数が31日で、そのうち22日が稼働日である場合、稼働日数は22日です。"
      },
      "application": {
        "title": "プロジェクト管理における暦日の応用",
        "items": [
          {
            "title": "プロジェクト進捗追跡：",
            "content": "暦日と工期を比較することで、プロジェクトマネージャーはプロジェクトの実際の進捗を把握できます。暦日数が予想工期を大幅に超える場合、プロジェクトに遅延リスクがある可能性を示しており、対策を講じる必要があります。"
          },
          {
            "title": "リソース配分と最適化：",
            "content": "暦日と工期に基づいて、プロジェクトマネージャーはチームリソースを合理的に配分し、作業配置を最適化できます。たとえば、祝日前には人員を適切に増やして、重要なタスクを確実に時間通りに完了させることができます。"
          },
          {
            "title": "リスク管理：",
            "content": "暦日計算はプロジェクトリスクの特定と管理に役立ちます。たとえば、重要な材料の納期が長期休暇と重なる場合、プロジェクトの遅延を引き起こす可能性があります。プロジェクトマネージャーはこのようなリスクを事前に特定し、対策を策定する必要があります。"
          }
        ]
      },
      "considerations": {
        "title": "暦日計算の考慮事項",
        "items": [
          {
            "title": "時差を考慮する：",
            "content": "プロジェクトが異なるタイムゾーンでの協力を含む場合、暦日計算で時差要素を考慮する必要があります。異なるタイムゾーンの休日の配置は異なる場合があり、円滑なコミュニケーションと協力を確保するために調整が必要です。"
          },
          {
            "title": "柔軟な調整：",
            "content": "暦日計算は時間管理のフレームワークを提供しますが、実践ではある程度の柔軟性が必要です。予期せぬ出来事や変更要求に対して、プロジェクトマネージャーはプロジェクトの円滑な進行を確保するために暦日の配置をタイムリーに調整する必要があります。"
          }
        ],
        "conclusion": "暦日計算はプロジェクトスケジュール管理の基礎であり、工期見積もり、進捗追跡、リソース最適化の基礎を提供します。暦日と工期の関係を理解し、休日などの特殊な状況を適切に処理することで、プロジェクトマネージャーはプロジェクトスケジュールをより良く制御し、納品の正確性と効率を向上させることができます。ますます複雑化するプロジェクト環境では、正確な暦日計算と柔軟な工期管理がプロジェクト成功の鍵となります。"
      }
    }
  }
}